# Part 7

In [30]:
import pandas as pd

# Persiapan Data Frame

In [31]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  tANQKgJr5x  0.509588  1.199632  0.770454  0.939428
1  wTJl1Tm9g2  0.401846 -1.242818  0.538492 -0.951673
2  6q1N1PNAEV -0.699150       NaN       NaN       NaN
3  cJtnf7s5jk -2.446354  0.546417  0.333027 -0.668508
4  6UzkS3VQNM -0.013025 -0.518756  0.378948  0.023367

In [32]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  tANQKgJr5x  0.509588  1.199632  0.770454  0.939428
1  wTJl1Tm9g2  0.401846 -1.242818  0.538492 -0.951673
2  6q1N1PNAEV -0.699150       NaN       NaN       NaN
3  cJtnf7s5jk -2.446354  0.546417  0.333027 -0.668508
4  6UzkS3VQNM -0.013025 -0.518756  0.378948  0.023367

In [33]:
df_backup = df.copy(deep=True)

# Menghapus(drop) Setiap Kolom Yang Mengandung Missing Values

In [34]:
df = df.dropna(axis='columns')
df.head()

            Z
0  tANQKgJr5x
1  wTJl1Tm9g2
2  6q1N1PNAEV
3  cJtnf7s5jk
4  6UzkS3VQNM

# Menghapus(drop) Setiap Baris Yang Mengandung Missing Values

In [35]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  tANQKgJr5x  0.509588  1.199632  0.770454  0.939428
1  wTJl1Tm9g2  0.401846 -1.242818  0.538492 -0.951673
3  cJtnf7s5jk -2.446354  0.546417  0.333027 -0.668508
4  6UzkS3VQNM -0.013025 -0.518756  0.378948  0.023367
7  gKnnWOy4IV  0.613563  0.322123  0.827871  0.473662

# Persentase Missing Values Untuk Tiap Kolom

In [36]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.066667
B    0.066667
C    0.100000
D    0.166667
dtype: float64

# Menghapus (drop) Setiap Kolom Yang Mengandung Missing Values Berdasarkan Threshold

In [37]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold,axis='columns')
df.head()

            Z         A         B         C
0  tANQKgJr5x  0.509588  1.199632  0.770454
1  wTJl1Tm9g2  0.401846 -1.242818  0.538492
2  6q1N1PNAEV -0.699150       NaN       NaN
3  cJtnf7s5jk -2.446354  0.546417  0.333027
4  6UzkS3VQNM -0.013025 -0.518756  0.378948

In [38]:
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C
0  tANQKgJr5x  0.509588  1.199632  0.770454
1  wTJl1Tm9g2  0.401846 -1.242818  0.538492
3  cJtnf7s5jk -2.446354  0.546417  0.333027
4  6UzkS3VQNM -0.013025 -0.518756  0.378948
5  hmKRMciU6V  0.801781 -0.514304 -0.499269